farmer-bism/bismath_evalkit_target/asp/arch/rx_gcc/rx610.h
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 * 
 *  Copyright (C) 2008-2010 by Witz Corporation, JAPAN
 * 
 *  上記著作権者は，以下の(1)〜(4)の条件を満たす場合に限り，本ソフトウェ
 *  ア（本ソフトウェアを改変したものを含む．以下同じ）を使用・複製・改
 *  変・再配布（以下，利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (b) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *      また，本ソフトウェアのユーザまたはエンドユーザからのいかなる理
 *      由に基づく請求からも，上記著作権者およびTOPPERSプロジェクトを
 *      免責すること．
 * 
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，特定の使用目的
 *  に対する適合性も含めて，いかなる保証も行わない．また，本ソフトウェ
 *  アの利用により直接的または間接的に生じたいかなる損害に関しても，そ
 *  の責任を負わない．
 * 
 */

/*
 *  RX610に依存する定義
 */
#ifndef TOPPERS_RX610_H
#define TOPPERS_RX610_H

/*
 *  CPU例外ハンドラ番号の定義(固定ベクタテーブル)
 *
 *  番号の範囲は0 - 31
 */
#define INT_PRIVILEGED_INSTRUNCTION		20		/* 特権命令例外 */
#define INT_UNDEF_INSTRUNCTION			23		/* 未定義命令例外 */
#define INT_FLOATINGPOINT_INSTRUCTION	25		/* 浮動小数点例外 */
#define INT_NMI							30		/* ノンマスカブル割り込み */
#define INT_RESET						31		/* リセット */

/*
 *  割込み番号の定義(可変ベクタテーブル)
 */
#define INT_BUSERR			16
#define INT_FCU_FCUERR		21
#define INT_FCU_FRDYI		23
#define INT_CMT0_CMI0		28
#define INT_CMT1_CMI1		29
#define INT_CMT2_CMI2		30
#define INT_CMT3_CMI3		31
#define INT_IRQ0			64
#define INT_IRQ1			65
#define INT_IRQ2			66
#define INT_IRQ3			67
#define INT_IRQ4			68
#define INT_IRQ5			69
#define INT_IRQ6			70
#define INT_IRQ7			71
#define INT_IRQ8			72
#define INT_IRQ9			73
#define INT_IRQ10			74
#define INT_IRQ11			75
#define INT_IRQ12			76
#define INT_IRQ13			77
#define INT_IRQ14			78
#define INT_IRQ15			79
#define INT_WDT_WOVI		96
#define INT_AD0_ADI0		98
#define INT_AD1_ADI1		99
#define INT_AD2_ADI2		100
#define INT_AD3_ADI3		101
#define INT_TPU0_TGI0A		104
#define INT_TPU0_TGI0B		105
#define INT_TPU0_TGI0C		106
#define INT_TPU0_TGI0D		107
#define INT_TPU0_TCI0V		108
#define INT_TPU1_TGI1A		111
#define INT_TPU1_TGI1B		112
#define INT_TPU1_TCI1V		115
#define INT_TPU1_TCI1U		116
#define INT_TPU2_TGI2A		117
#define INT_TPU2_TGI2B		118
#define INT_TPU2_TCI2V		120
#define INT_TPU2_TCI2U		121
#define INT_TPU3_TGI3A		122
#define INT_TPU3_TGI3B		123
#define INT_TPU3_TGI3C		124
#define INT_TPU3_TGI3D		125
#define INT_TPU3_TCI3V		126
#define INT_TPU4_TGI4A		127
#define INT_TPU4_TGI4B		128
#define INT_TPU4_TCI4V		131
#define INT_TPU4_TCI4U		132
#define INT_TPU5_TGI5A		133
#define INT_TPU5_TGI5B		134
#define INT_TPU5_TCI5V		136
#define INT_TPU5_TCI5U		137
#define INT_TPU6_TGI6A		138
#define INT_TPU6_TGI6B		139
#define INT_TPU6_TGI6C		140
#define INT_TPU6_TGI6D		141
#define INT_TPU6_TCI6V		142
#define INT_TPU7_TGI7A		145
#define INT_TPU7_TGI7B		146
#define INT_TPU7_TCI7V		149
#define INT_TPU7_TCI7U		150
#define INT_TPU8_TGI8A		151
#define INT_TPU8_TGI8B		152
#define INT_TPU8_TCI8V		154
#define INT_TPU8_TCI8U		155
#define INT_TPU9_TGI9A		156
#define INT_TPU9_TGI9B		157
#define INT_TPU9_TGI9C		158
#define INT_TPU9_TGI9D		159
#define INT_TPU9_TCI9V		160
#define INT_TPU10_TGI10A	161
#define INT_TPU10_TGI10B	162
#define INT_TPU10_TCI10V	165
#define INT_TPU10_TCI10U	166
#define INT_TPU11_TGI11A	167
#define INT_TPU11_TGI11B	168
#define INT_TPU11_TCI11V	170
#define INT_TPU11_TCI11U	171
#define INT_TMR0_CMI0A		174
#define INT_TMR0_CMI0B		175
#define INT_TMR0_OV0I		176
#define INT_TMR1_CMI1A		177
#define INT_TMR1_CMI1B		178
#define INT_TMR1_OV1I		179
#define INT_TMR2_CMI2A		180
#define INT_TMR2_CMI2B		181
#define INT_TMR2_OV2I		182
#define INT_TMR3_CMI3A		183
#define INT_TMR3_CMI3B		184
#define INT_TMR3_OV3I		185
#define INT_DMAC_DMTEND0	198
#define INT_DMAC_DMTEND1	199
#define INT_DMAC_DMTEND2	200
#define INT_DMAC_DMTEND3	201
#define INT_SCI0_ERI0		214
#define INT_SCI0_RXI0		215
#define INT_SCI0_TXI0		216
#define INT_SCI0_TEI0		217
#define INT_SCI1_ERI1		218
#define INT_SCI1_RXI1		219
#define INT_SCI1_TXI1		220
#define INT_SCI1_TEI1		221
#define INT_SCI2_ERI2		222
#define INT_SCI2_RXI2		223
#define INT_SCI2_TXI2		224
#define INT_SCI2_TEI2		225
#define INT_SCI3_ERI3		226
#define INT_SCI3_RXI3		227
#define INT_SCI3_TXI3		228
#define INT_SCI3_TEI3		229
#define INT_SCI4_ERI4		230
#define INT_SCI4_RXI4		231
#define INT_SCI4_TXI4		232
#define INT_SCI4_TEI4		233
#define INT_SCI5_ERI5		234
#define INT_SCI5_RXI5		235
#define INT_SCI5_TXI5		236
#define INT_SCI5_TEI5		237
#define INT_SCI6_ERI6		238
#define INT_SCI6_RXI6		239
#define INT_SCI6_TXI6		240
#define INT_SCI6_TEI6		241
#define INT_RIIC0_EEI0		246
#define INT_RIIC0_RXI0		247
#define INT_RIIC0_TXI0		248
#define INT_RIIC0_TEI0		249
#define INT_RIIC1_EEI1		250
#define INT_RIIC1_RXI1		251
#define INT_RIIC1_TXI1		252
#define INT_RIIC1_TEI1		253

/*
 *  各モジュールのレジスタ及び設定ビット情報
 */
/*
 * モジュールストップコントロールレジスタA（MSTPCRA）
 */
#define SYSTEM_MSTPCRA_ADDR			( ( volatile uint32_t  * )0x00080010 )
#define SYSTEM_MSTPCRA_MSTPA4_BIT	( 1UL << 4U )
#define SYSTEM_MSTPCRA_MSTPA5_BIT	( 1UL << 5U )
#define SYSTEM_MSTPCRA_MSTPA10_BIT	( 1UL << 10U )
#define SYSTEM_MSTPCRA_MSTPA11_BIT	( 1UL << 11U )
#define SYSTEM_MSTPCRA_MSTPA12_BIT	( 1UL << 12U )
#define SYSTEM_MSTPCRA_MSTPA13_BIT	( 1UL << 13U )
#define SYSTEM_MSTPCRA_MSTPA14_BIT	( 1UL << 14U )
#define SYSTEM_MSTPCRA_MSTPA15_BIT	( 1UL << 15U )
#define SYSTEM_MSTPCRA_MSTPA19_BIT	( 1UL << 19U )
#define SYSTEM_MSTPCRA_MSTPA20_BIT	( 1UL << 20U )
#define SYSTEM_MSTPCRA_MSTPA21_BIT	( 1UL << 21U )
#define SYSTEM_MSTPCRA_MSTPA22_BIT	( 1UL << 22U )
#define SYSTEM_MSTPCRA_MSTPA23_BIT	( 1UL << 23U )
#define SYSTEM_MSTPCRA_MSTPA27_BIT	( 1UL << 27U )
#define SYSTEM_MSTPCRA_MSTPA28_BIT	( 1UL << 28U )
#define SYSTEM_MSTPCRA_ACSE_BIT		( 1UL << 31U)

