farmer-bism/bismath_evalkit_target/asp/arch/rx_gcc/rx610.h
/*
 * モジュールストップコントロールレジスタB（MSTPCRB）
 */
#define SYSTEM_MSTPCRB_ADDR			( ( volatile uint32_t  * )0x00080014 )
#define SYSTEM_MSTPCRB_MSTPB20_BIT	( 1UL << 20U )
#define SYSTEM_MSTPCRB_MSTPB21_BIT	( 1UL << 21U )
#define SYSTEM_MSTPCRB_MSTPB23_BIT	( 1UL << 23U )
#define SYSTEM_MSTPCRB_MSTPB25_BIT	( 1UL << 25U )
#define SYSTEM_MSTPCRB_MSTPB26_BIT	( 1UL << 26U )
#define SYSTEM_MSTPCRB_MSTPB27_BIT	( 1UL << 27U )
#define SYSTEM_MSTPCRB_MSTPB28_BIT	( 1UL << 28U )
#define SYSTEM_MSTPCRB_MSTPB29_BIT	( 1UL << 29U )
#define SYSTEM_MSTPCRB_MSTPB30_BIT	( 1UL << 30U )
#define SYSTEM_MSTPCRB_MSTPB31_BIT	( 1UL << 31U )

/*
 * モジュールストップコントロールレジスタC（MSTPCRC）
 */
#define SYSTEM_MSTPCRC_ADDR			( ( volatile uint32_t  * )0x00080018 )
#define SYSTEM_MSTPCRC_MSTPC0_BIT	( 1UL << 0U )
#define SYSTEM_MSTPCRC_MSTPC1_BIT	( 1UL << 1U )

/*
 * 割り込み要求レジスタ
 */
#define ICU_IR016_ADDR			( ( volatile uint8_t  * )0x00087010 )
#define ICU_IR021_ADDR			( ( volatile uint8_t  * )0x00087015 )
#define ICU_IR023_ADDR			( ( volatile uint8_t  * )0x00087017 )
#define ICU_IR028_ADDR			( ( volatile uint8_t  * )0x0008701C )
#define ICU_IR029_ADDR			( ( volatile uint8_t  * )0x0008701D )
#define ICU_IR030_ADDR			( ( volatile uint8_t  * )0x0008701E )
#define ICU_IR031_ADDR			( ( volatile uint8_t  * )0x0008701F )
#define ICU_IR064_ADDR			( ( volatile uint8_t  * )0x00087040 )
#define ICU_IR065_ADDR			( ( volatile uint8_t  * )0x00087041 )
#define ICU_IR066_ADDR			( ( volatile uint8_t  * )0x00087042 )
#define ICU_IR067_ADDR			( ( volatile uint8_t  * )0x00087043 )
#define ICU_IR068_ADDR			( ( volatile uint8_t  * )0x00087044 )
#define ICU_IR069_ADDR			( ( volatile uint8_t  * )0x00087045 )
#define ICU_IR070_ADDR			( ( volatile uint8_t  * )0x00087046 )
#define ICU_IR071_ADDR			( ( volatile uint8_t  * )0x00087047 )
#define ICU_IR072_ADDR			( ( volatile uint8_t  * )0x00087048 )
#define ICU_IR073_ADDR			( ( volatile uint8_t  * )0x00087049 )
#define ICU_IR074_ADDR			( ( volatile uint8_t  * )0x0008704A )
#define ICU_IR075_ADDR			( ( volatile uint8_t  * )0x0008704B )
#define ICU_IR076_ADDR			( ( volatile uint8_t  * )0x0008704C )
#define ICU_IR077_ADDR			( ( volatile uint8_t  * )0x0008704D )
#define ICU_IR078_ADDR			( ( volatile uint8_t  * )0x0008704E )
#define ICU_IR079_ADDR			( ( volatile uint8_t  * )0x0008704F )
#define ICU_IR096_ADDR			( ( volatile uint8_t  * )0x00087060 )
#define ICU_IR098_ADDR			( ( volatile uint8_t  * )0x00087062 )
#define ICU_IR099_ADDR			( ( volatile uint8_t  * )0x00087063 )
#define ICU_IR100_ADDR			( ( volatile uint8_t  * )0x00087064 )
#define ICU_IR101_ADDR			( ( volatile uint8_t  * )0x00087065 )
#define ICU_IR104_ADDR			( ( volatile uint8_t  * )0x00087068 )
#define ICU_IR105_ADDR			( ( volatile uint8_t  * )0x00087069 )
#define ICU_IR106_ADDR			( ( volatile uint8_t  * )0x0008706A )
#define ICU_IR107_ADDR			( ( volatile uint8_t  * )0x0008706B )
#define ICU_IR108_ADDR			( ( volatile uint8_t  * )0x0008706C )
#define ICU_IR111_ADDR			( ( volatile uint8_t  * )0x0008706F )
#define ICU_IR112_ADDR			( ( volatile uint8_t  * )0x00087070 )
#define ICU_IR115_ADDR			( ( volatile uint8_t  * )0x00087073 )
#define ICU_IR116_ADDR			( ( volatile uint8_t  * )0x00087074 )
#define ICU_IR117_ADDR			( ( volatile uint8_t  * )0x00087075 )
#define ICU_IR118_ADDR			( ( volatile uint8_t  * )0x00087076 )
#define ICU_IR120_ADDR			( ( volatile uint8_t  * )0x00087078 )
#define ICU_IR121_ADDR			( ( volatile uint8_t  * )0x00087079 )
#define ICU_IR122_ADDR			( ( volatile uint8_t  * )0x0008707A )
#define ICU_IR123_ADDR			( ( volatile uint8_t  * )0x0008707B )
#define ICU_IR124_ADDR			( ( volatile uint8_t  * )0x0008707C )
#define ICU_IR125_ADDR			( ( volatile uint8_t  * )0x0008707D )
#define ICU_IR126_ADDR			( ( volatile uint8_t  * )0x0008707E )
#define ICU_IR127_ADDR			( ( volatile uint8_t  * )0x0008707F )
#define ICU_IR128_ADDR			( ( volatile uint8_t  * )0x00087080 )
#define ICU_IR131_ADDR			( ( volatile uint8_t  * )0x00087083 )
#define ICU_IR132_ADDR			( ( volatile uint8_t  * )0x00087084 )
#define ICU_IR133_ADDR			( ( volatile uint8_t  * )0x00087085 )
#define ICU_IR134_ADDR			( ( volatile uint8_t  * )0x00087086 )
#define ICU_IR136_ADDR			( ( volatile uint8_t  * )0x00087088 )
#define ICU_IR137_ADDR			( ( volatile uint8_t  * )0x00087089 )
#define ICU_IR138_ADDR			( ( volatile uint8_t  * )0x0008708A )
#define ICU_IR139_ADDR			( ( volatile uint8_t  * )0x0008708B )
#define ICU_IR140_ADDR			( ( volatile uint8_t  * )0x0008708C )
#define ICU_IR141_ADDR			( ( volatile uint8_t  * )0x0008708D )
#define ICU_IR142_ADDR			( ( volatile uint8_t  * )0x0008708E )
#define ICU_IR145_ADDR			( ( volatile uint8_t  * )0x00087091 )
#define ICU_IR146_ADDR			( ( volatile uint8_t  * )0x00087092 )
#define ICU_IR149_ADDR			( ( volatile uint8_t  * )0x00087095 )
#define ICU_IR150_ADDR			( ( volatile uint8_t  * )0x00087096 )
#define ICU_IR151_ADDR			( ( volatile uint8_t  * )0x00087097 )
#define ICU_IR152_ADDR			( ( volatile uint8_t  * )0x00087098 )
#define ICU_IR154_ADDR			( ( volatile uint8_t  * )0x0008709A )
#define ICU_IR155_ADDR			( ( volatile uint8_t  * )0x0008709B )
#define ICU_IR156_ADDR			( ( volatile uint8_t  * )0x0008709C )
#define ICU_IR157_ADDR			( ( volatile uint8_t  * )0x0008709D )
#define ICU_IR158_ADDR			( ( volatile uint8_t  * )0x0008709E )
#define ICU_IR159_ADDR			( ( volatile uint8_t  * )0x0008709F )
#define ICU_IR160_ADDR			( ( volatile uint8_t  * )0x000870A0 )
#define ICU_IR161_ADDR			( ( volatile uint8_t  * )0x000870A1 )
#define ICU_IR162_ADDR			( ( volatile uint8_t  * )0x000870A2 )
#define ICU_IR165_ADDR			( ( volatile uint8_t  * )0x000870A5 )
#define ICU_IR166_ADDR			( ( volatile uint8_t  * )0x000870A6 )
#define ICU_IR167_ADDR			( ( volatile uint8_t  * )0x000870A7 )
#define ICU_IR168_ADDR			( ( volatile uint8_t  * )0x000870A8 )
#define ICU_IR170_ADDR			( ( volatile uint8_t  * )0x000870AA )
#define ICU_IR171_ADDR			( ( volatile uint8_t  * )0x000870AB )
#define ICU_IR174_ADDR			( ( volatile uint8_t  * )0x000870AE )
#define ICU_IR175_ADDR			( ( volatile uint8_t  * )0x000870AF )
#define ICU_IR176_ADDR			( ( volatile uint8_t  * )0x000870B0 )
#define ICU_IR177_ADDR			( ( volatile uint8_t  * )0x000870B1 )
#define ICU_IR178_ADDR			( ( volatile uint8_t  * )0x000870B2 )
#define ICU_IR179_ADDR			( ( volatile uint8_t  * )0x000870B3 )
#define ICU_IR180_ADDR			( ( volatile uint8_t  * )0x000870B4 )
#define ICU_IR181_ADDR			( ( volatile uint8_t  * )0x000870B5 )
#define ICU_IR182_ADDR			( ( volatile uint8_t  * )0x000870B6 )
#define ICU_IR183_ADDR			( ( volatile uint8_t  * )0x000870B7 )
#define ICU_IR184_ADDR			( ( volatile uint8_t  * )0x000870B8 )
#define ICU_IR185_ADDR			( ( volatile uint8_t  * )0x000870B9 )
#define ICU_IR198_ADDR			( ( volatile uint8_t  * )0x000870C6 )
#define ICU_IR199_ADDR			( ( volatile uint8_t  * )0x000870C7 )
#define ICU_IR200_ADDR			( ( volatile uint8_t  * )0x000870C8 )
#define ICU_IR201_ADDR			( ( volatile uint8_t  * )0x000870C9 )
#define ICU_IR214_ADDR			( ( volatile uint8_t  * )0x000870D6 )
#define ICU_IR215_ADDR			( ( volatile uint8_t  * )0x000870D7 )
#define ICU_IR216_ADDR			( ( volatile uint8_t  * )0x000870D8 )
#define ICU_IR217_ADDR			( ( volatile uint8_t  * )0x000870D9 )
#define ICU_IR218_ADDR			( ( volatile uint8_t  * )0x000870DA )
#define ICU_IR219_ADDR			( ( volatile uint8_t  * )0x000870DB )
#define ICU_IR220_ADDR			( ( volatile uint8_t  * )0x000870DC )
#define ICU_IR221_ADDR			( ( volatile uint8_t  * )0x000870DD )
#define ICU_IR222_ADDR			( ( volatile uint8_t  * )0x000870DE )
#define ICU_IR223_ADDR			( ( volatile uint8_t  * )0x000870DF )
#define ICU_IR224_ADDR			( ( volatile uint8_t  * )0x000870E0 )
#define ICU_IR225_ADDR			( ( volatile uint8_t  * )0x000870E1 )
#define ICU_IR226_ADDR			( ( volatile uint8_t  * )0x000870E2 )
#define ICU_IR227_ADDR			( ( volatile uint8_t  * )0x000870E3 )
#define ICU_IR228_ADDR			( ( volatile uint8_t  * )0x000870E4 )
#define ICU_IR229_ADDR			( ( volatile uint8_t  * )0x000870E5 )
#define ICU_IR230_ADDR			( ( volatile uint8_t  * )0x000870E6 )
#define ICU_IR231_ADDR			( ( volatile uint8_t  * )0x000870E7 )
#define ICU_IR232_ADDR			( ( volatile uint8_t  * )0x000870E8 )
#define ICU_IR233_ADDR			( ( volatile uint8_t  * )0x000870E9 )
#define ICU_IR234_ADDR			( ( volatile uint8_t  * )0x000870EA )
#define ICU_IR235_ADDR			( ( volatile uint8_t  * )0x000870EB )
#define ICU_IR236_ADDR			( ( volatile uint8_t  * )0x000870EC )
#define ICU_IR237_ADDR			( ( volatile uint8_t  * )0x000870ED )
#define ICU_IR238_ADDR			( ( volatile uint8_t  * )0x000870EE )
#define ICU_IR239_ADDR			( ( volatile uint8_t  * )0x000870EF )
#define ICU_IR240_ADDR			( ( volatile uint8_t  * )0x000870F0 )
#define ICU_IR241_ADDR			( ( volatile uint8_t  * )0x000870F1 )
#define ICU_IR246_ADDR			( ( volatile uint8_t  * )0x000870F6 )
#define ICU_IR247_ADDR			( ( volatile uint8_t  * )0x000870F7 )
#define ICU_IR248_ADDR			( ( volatile uint8_t  * )0x000870F8 )
#define ICU_IR249_ADDR			( ( volatile uint8_t  * )0x000870F9 )
#define ICU_IR250_ADDR			( ( volatile uint8_t  * )0x000870FA )
#define ICU_IR251_ADDR			( ( volatile uint8_t  * )0x000870FB )
#define ICU_IR252_ADDR			( ( volatile uint8_t  * )0x000870FC )
#define ICU_IR253_ADDR			( ( volatile uint8_t  * )0x000870FD )
#define ICU_IR_BIT				( 1U << 0U )

