farmer-bism/bismath_evalkit_target/asp/arch/rx_gcc/rx610.h
/*
 * 割り込み要求先設定レジスタ
 */
#define ICU_ISELR028_ADDR		( ( volatile uint8_t  * )0x0008711C )
#define ICU_ISELR029_ADDR		( ( volatile uint8_t  * )0x0008711D )
#define ICU_ISELR030_ADDR		( ( volatile uint8_t  * )0x0008711E )
#define ICU_ISELR031_ADDR		( ( volatile uint8_t  * )0x0008711F )
#define ICU_ISELR064_ADDR		( ( volatile uint8_t  * )0x00087140 )
#define ICU_ISELR065_ADDR		( ( volatile uint8_t  * )0x00087141 )
#define ICU_ISELR066_ADDR		( ( volatile uint8_t  * )0x00087142 )
#define ICU_ISELR067_ADDR		( ( volatile uint8_t  * )0x00087143 )
#define ICU_ISELR068_ADDR		( ( volatile uint8_t  * )0x00087144 )
#define ICU_ISELR069_ADDR		( ( volatile uint8_t  * )0x00087145 )
#define ICU_ISELR070_ADDR		( ( volatile uint8_t  * )0x00087146 )
#define ICU_ISELR071_ADDR		( ( volatile uint8_t  * )0x00087147 )
#define ICU_ISELR072_ADDR		( ( volatile uint8_t  * )0x00087148 )
#define ICU_ISELR073_ADDR		( ( volatile uint8_t  * )0x00087149 )
#define ICU_ISELR074_ADDR		( ( volatile uint8_t  * )0x0008714A )
#define ICU_ISELR075_ADDR		( ( volatile uint8_t  * )0x0008714B )
#define ICU_ISELR076_ADDR		( ( volatile uint8_t  * )0x0008714C )
#define ICU_ISELR077_ADDR		( ( volatile uint8_t  * )0x0008714D )
#define ICU_ISELR078_ADDR		( ( volatile uint8_t  * )0x0008714E )
#define ICU_ISELR079_ADDR		( ( volatile uint8_t  * )0x0008714F )
#define ICU_ISELR098_ADDR		( ( volatile uint8_t  * )0x00087162 )
#define ICU_ISELR099_ADDR		( ( volatile uint8_t  * )0x00087163 )
#define ICU_ISELR100_ADDR		( ( volatile uint8_t  * )0x00087164 )
#define ICU_ISELR101_ADDR		( ( volatile uint8_t  * )0x00087165 )
#define ICU_ISELR104_ADDR		( ( volatile uint8_t  * )0x00087168 )
#define ICU_ISELR105_ADDR		( ( volatile uint8_t  * )0x00087169 )
#define ICU_ISELR106_ADDR		( ( volatile uint8_t  * )0x0008716A )
#define ICU_ISELR107_ADDR		( ( volatile uint8_t  * )0x0008716B )
#define ICU_ISELR111_ADDR		( ( volatile uint8_t  * )0x0008716F )
#define ICU_ISELR112_ADDR		( ( volatile uint8_t  * )0x00087170 )
#define ICU_ISELR117_ADDR		( ( volatile uint8_t  * )0x00087175 )
#define ICU_ISELR118_ADDR		( ( volatile uint8_t  * )0x00087176 )
#define ICU_ISELR122_ADDR		( ( volatile uint8_t  * )0x0008717A )
#define ICU_ISELR123_ADDR		( ( volatile uint8_t  * )0x0008717B )
#define ICU_ISELR124_ADDR		( ( volatile uint8_t  * )0x0008717C )
#define ICU_ISELR125_ADDR		( ( volatile uint8_t  * )0x0008717D )
#define ICU_ISELR127_ADDR		( ( volatile uint8_t  * )0x0008717F )
#define ICU_ISELR128_ADDR		( ( volatile uint8_t  * )0x00087180 )
#define ICU_ISELR133_ADDR		( ( volatile uint8_t  * )0x00087185 )
#define ICU_ISELR134_ADDR		( ( volatile uint8_t  * )0x00087186 )
#define ICU_ISELR138_ADDR		( ( volatile uint8_t  * )0x0008718A )
#define ICU_ISELR139_ADDR		( ( volatile uint8_t  * )0x0008718B )
#define ICU_ISELR140_ADDR		( ( volatile uint8_t  * )0x0008718C )
#define ICU_ISELR141_ADDR		( ( volatile uint8_t  * )0x0008718D )
#define ICU_ISELR145_ADDR		( ( volatile uint8_t  * )0x00087191 )
#define ICU_ISELR146_ADDR		( ( volatile uint8_t  * )0x00087192 )
#define ICU_ISELR151_ADDR		( ( volatile uint8_t  * )0x00087197 )
#define ICU_ISELR152_ADDR		( ( volatile uint8_t  * )0x00087198 )
#define ICU_ISELR156_ADDR		( ( volatile uint8_t  * )0x0008719C )
#define ICU_ISELR157_ADDR		( ( volatile uint8_t  * )0x0008719D )
#define ICU_ISELR158_ADDR		( ( volatile uint8_t  * )0x0008719E )
#define ICU_ISELR159_ADDR		( ( volatile uint8_t  * )0x0008719F )
#define ICU_ISELR161_ADDR		( ( volatile uint8_t  * )0x000871A1 )
#define ICU_ISELR162_ADDR		( ( volatile uint8_t  * )0x000871A2 )
#define ICU_ISELR167_ADDR		( ( volatile uint8_t  * )0x000871A7 )
#define ICU_ISELR168_ADDR		( ( volatile uint8_t  * )0x000871A8 )
#define ICU_ISELR174_ADDR		( ( volatile uint8_t  * )0x000871AE )
#define ICU_ISELR175_ADDR		( ( volatile uint8_t  * )0x000871AF )
#define ICU_ISELR177_ADDR		( ( volatile uint8_t  * )0x000871B1 )
#define ICU_ISELR178_ADDR		( ( volatile uint8_t  * )0x000871B2 )
#define ICU_ISELR180_ADDR		( ( volatile uint8_t  * )0x000871B4 )
#define ICU_ISELR181_ADDR		( ( volatile uint8_t  * )0x000871B5 )
#define ICU_ISELR183_ADDR		( ( volatile uint8_t  * )0x000871B7 )
#define ICU_ISELR184_ADDR		( ( volatile uint8_t  * )0x000871B8 )
#define ICU_ISELR198_ADDR		( ( volatile uint8_t  * )0x000871C6 )
#define ICU_ISELR199_ADDR		( ( volatile uint8_t  * )0x000871C7 )
#define ICU_ISELR200_ADDR		( ( volatile uint8_t  * )0x000871C8 )
#define ICU_ISELR201_ADDR		( ( volatile uint8_t  * )0x000871C9 )
#define ICU_ISELR215_ADDR		( ( volatile uint8_t  * )0x000871D7 )
#define ICU_ISELR216_ADDR		( ( volatile uint8_t  * )0x000871D8 )
#define ICU_ISELR219_ADDR		( ( volatile uint8_t  * )0x000871DB )
#define ICU_ISELR220_ADDR		( ( volatile uint8_t  * )0x000871DC )
#define ICU_ISELR223_ADDR		( ( volatile uint8_t  * )0x000871DF )
#define ICU_ISELR224_ADDR		( ( volatile uint8_t  * )0x000871E0 )
#define ICU_ISELR227_ADDR		( ( volatile uint8_t  * )0x000871E3 )
#define ICU_ISELR228_ADDR		( ( volatile uint8_t  * )0x000871E4 )
#define ICU_ISELR231_ADDR		( ( volatile uint8_t  * )0x000871E7 )
#define ICU_ISELR232_ADDR		( ( volatile uint8_t  * )0x000871E8 )
#define ICU_ISELR235_ADDR		( ( volatile uint8_t  * )0x000871EB )
#define ICU_ISELR236_ADDR		( ( volatile uint8_t  * )0x000871EC )
#define ICU_ISELR239_ADDR		( ( volatile uint8_t  * )0x000871EF )
#define ICU_ISELR240_ADDR		( ( volatile uint8_t  * )0x000871F0 )
#define ICU_ISELR247_ADDR		( ( volatile uint8_t  * )0x000871F7 )
#define ICU_ISELR248_ADDR		( ( volatile uint8_t  * )0x000871F8 )
#define ICU_ISELR251_ADDR		( ( volatile uint8_t  * )0x000871FB )
#define ICU_ISELR252_ADDR		( ( volatile uint8_t  * )0x000871FC )
#define ICU_ISEL_BIT			( 3U << 0U )

/*
 * 割り込み要求許可レジスタ
 */
#define ICU_IER02_ADDR			( ( volatile uint8_t  * )0x00087202 )
#define ICU_IER03_ADDR			( ( volatile uint8_t  * )0x00087203 )
#define ICU_IER08_ADDR			( ( volatile uint8_t  * )0x00087208 )
#define ICU_IER09_ADDR			( ( volatile uint8_t  * )0x00087209 )
#define ICU_IER0C_ADDR			( ( volatile uint8_t  * )0x0008720C )
#define ICU_IER0D_ADDR			( ( volatile uint8_t  * )0x0008720D )
#define ICU_IER0E_ADDR			( ( volatile uint8_t  * )0x0008720E )
#define ICU_IER0F_ADDR			( ( volatile uint8_t  * )0x0008720F )
#define ICU_IER10_ADDR			( ( volatile uint8_t  * )0x00087210 )
#define ICU_IER11_ADDR			( ( volatile uint8_t  * )0x00087211 )
#define ICU_IER12_ADDR			( ( volatile uint8_t  * )0x00087212 )
#define ICU_IER13_ADDR			( ( volatile uint8_t  * )0x00087213 )
#define ICU_IER14_ADDR			( ( volatile uint8_t  * )0x00087214 )
#define ICU_IER15_ADDR			( ( volatile uint8_t  * )0x00087215 )
#define ICU_IER16_ADDR			( ( volatile uint8_t  * )0x00087216 )
#define ICU_IER17_ADDR			( ( volatile uint8_t  * )0x00087217 )
#define ICU_IER18_ADDR			( ( volatile uint8_t  * )0x00087218 )
#define ICU_IER19_ADDR			( ( volatile uint8_t  * )0x00087219 )
#define ICU_IER1A_ADDR			( ( volatile uint8_t  * )0x0008721A )
#define ICU_IER1B_ADDR			( ( volatile uint8_t  * )0x0008721B )
#define ICU_IER1C_ADDR			( ( volatile uint8_t  * )0x0008721C )
#define ICU_IER1D_ADDR			( ( volatile uint8_t  * )0x0008721D )
#define ICU_IER1E_ADDR			( ( volatile uint8_t  * )0x0008721E )
#define ICU_IER1F_ADDR			( ( volatile uint8_t  * )0x0008721F )
#define ICU_IEN0_BIT			( 1U << 0U )
#define ICU_IEN1_BIT			( 1U << 1U )
#define ICU_IEN2_BIT			( 1U << 2U )
#define ICU_IEN3_BIT			( 1U << 3U )
#define ICU_IEN4_BIT			( 1U << 4U )
#define ICU_IEN5_BIT			( 1U << 5U )
#define ICU_IEN6_BIT			( 1U << 6U )
#define ICU_IEN7_BIT			( 1U << 7U )

