farmer-bism/bismath_evalkit_target/asp/arch/rx_gcc/rx610.h
/* 
 * 割り込み要因プライオリティレジスタi(i=00h〜8Fh)の設定
 */
#define ICU_IPR00_ADDR			( ( volatile uint8_t  * )0x00087300 )
#define ICU_IPR01_ADDR			( ( volatile uint8_t  * )0x00087301 )
#define ICU_IPR02_ADDR			( ( volatile uint8_t  * )0x00087302 )
#define ICU_IPR04_ADDR			( ( volatile uint8_t  * )0x00087304 )
#define ICU_IPR05_ADDR			( ( volatile uint8_t  * )0x00087305 )
#define ICU_IPR06_ADDR			( ( volatile uint8_t  * )0x00087306 )
#define ICU_IPR07_ADDR			( ( volatile uint8_t  * )0x00087307 )
#define ICU_IPR20_ADDR			( ( volatile uint8_t  * )0x00087320 )
#define ICU_IPR21_ADDR			( ( volatile uint8_t  * )0x00087321 )
#define ICU_IPR22_ADDR			( ( volatile uint8_t  * )0x00087322 )
#define ICU_IPR23_ADDR			( ( volatile uint8_t  * )0x00087323 )
#define ICU_IPR24_ADDR			( ( volatile uint8_t  * )0x00087324 )
#define ICU_IPR25_ADDR			( ( volatile uint8_t  * )0x00087325 )
#define ICU_IPR26_ADDR			( ( volatile uint8_t  * )0x00087326 )
#define ICU_IPR27_ADDR			( ( volatile uint8_t  * )0x00087327 )
#define ICU_IPR28_ADDR			( ( volatile uint8_t  * )0x00087328 )
#define ICU_IPR29_ADDR			( ( volatile uint8_t  * )0x00087329 )
#define ICU_IPR2A_ADDR			( ( volatile uint8_t  * )0x0008732A )
#define ICU_IPR2B_ADDR			( ( volatile uint8_t  * )0x0008732B )
#define ICU_IPR2C_ADDR			( ( volatile uint8_t  * )0x0008732C )
#define ICU_IPR2D_ADDR			( ( volatile uint8_t  * )0x0008732D )
#define ICU_IPR2E_ADDR			( ( volatile uint8_t  * )0x0008732E )
#define ICU_IPR2F_ADDR			( ( volatile uint8_t  * )0x0008732F )
#define ICU_IPR40_ADDR			( ( volatile uint8_t  * )0x00087340 )
#define ICU_IPR44_ADDR			( ( volatile uint8_t  * )0x00087344 )
#define ICU_IPR45_ADDR			( ( volatile uint8_t  * )0x00087345 )
#define ICU_IPR46_ADDR			( ( volatile uint8_t  * )0x00087346 )
#define ICU_IPR47_ADDR			( ( volatile uint8_t  * )0x00087347 )
#define ICU_IPR4C_ADDR			( ( volatile uint8_t  * )0x0008734C )
#define ICU_IPR4D_ADDR			( ( volatile uint8_t  * )0x0008734D )
#define ICU_IPR4E_ADDR			( ( volatile uint8_t  * )0x0008734E )
#define ICU_IPR4F_ADDR			( ( volatile uint8_t  * )0x0008734F )
#define ICU_IPR50_ADDR			( ( volatile uint8_t  * )0x00087350 )
#define ICU_IPR51_ADDR			( ( volatile uint8_t  * )0x00087351 )
#define ICU_IPR52_ADDR			( ( volatile uint8_t  * )0x00087352 )
#define ICU_IPR53_ADDR			( ( volatile uint8_t  * )0x00087353 )
#define ICU_IPR54_ADDR			( ( volatile uint8_t  * )0x00087354 )
#define ICU_IPR55_ADDR			( ( volatile uint8_t  * )0x00087355 )
#define ICU_IPR56_ADDR			( ( volatile uint8_t  * )0x00087356 )
#define ICU_IPR57_ADDR			( ( volatile uint8_t  * )0x00087357 )
#define ICU_IPR58_ADDR			( ( volatile uint8_t  * )0x00087358 )
#define ICU_IPR59_ADDR			( ( volatile uint8_t  * )0x00087359 )
#define ICU_IPR5A_ADDR			( ( volatile uint8_t  * )0x0008735A )
#define ICU_IPR5B_ADDR			( ( volatile uint8_t  * )0x0008735B )
#define ICU_IPR5C_ADDR			( ( volatile uint8_t  * )0x0008735C )
#define ICU_IPR5D_ADDR			( ( volatile uint8_t  * )0x0008735D )
#define ICU_IPR5E_ADDR			( ( volatile uint8_t  * )0x0008735E )
#define ICU_IPR5F_ADDR			( ( volatile uint8_t  * )0x0008735F )
#define ICU_IPR60_ADDR			( ( volatile uint8_t  * )0x00087360 )
#define ICU_IPR61_ADDR			( ( volatile uint8_t  * )0x00087361 )
#define ICU_IPR62_ADDR			( ( volatile uint8_t  * )0x00087362 )
#define ICU_IPR63_ADDR			( ( volatile uint8_t  * )0x00087363 )
#define ICU_IPR68_ADDR			( ( volatile uint8_t  * )0x00087368 )
#define ICU_IPR69_ADDR			( ( volatile uint8_t  * )0x00087369 )
#define ICU_IPR6A_ADDR			( ( volatile uint8_t  * )0x0008736A )
#define ICU_IPR6B_ADDR			( ( volatile uint8_t  * )0x0008736B )
#define ICU_IPR70_ADDR			( ( volatile uint8_t  * )0x00087370 )
#define ICU_IPR71_ADDR			( ( volatile uint8_t  * )0x00087371 )
#define ICU_IPR72_ADDR			( ( volatile uint8_t  * )0x00087372 )
#define ICU_IPR73_ADDR			( ( volatile uint8_t  * )0x00087373 )
#define ICU_IPR80_ADDR			( ( volatile uint8_t  * )0x00087380 )
#define ICU_IPR81_ADDR			( ( volatile uint8_t  * )0x00087381 )
#define ICU_IPR82_ADDR			( ( volatile uint8_t  * )0x00087382 )
#define ICU_IPR83_ADDR			( ( volatile uint8_t  * )0x00087383 )
#define ICU_IPR84_ADDR			( ( volatile uint8_t  * )0x00087384 )
#define ICU_IPR85_ADDR			( ( volatile uint8_t  * )0x00087385 )
#define ICU_IPR86_ADDR			( ( volatile uint8_t  * )0x00087386 )
#define ICU_IPR88_ADDR			( ( volatile uint8_t  * )0x00087388 )
#define ICU_IPR89_ADDR			( ( volatile uint8_t  * )0x00087389 )
#define ICU_IPR8A_ADDR			( ( volatile uint8_t  * )0x0008738A )
#define ICU_IPR8B_ADDR			( ( volatile uint8_t  * )0x0008738B )
#define ICU_IPR8C_ADDR			( ( volatile uint8_t  * )0x0008738C )
#define ICU_IPR8D_ADDR			( ( volatile uint8_t  * )0x0008738D )
#define ICU_IPR8E_ADDR			( ( volatile uint8_t  * )0x0008738E )
#define ICU_IPR8F_ADDR			( ( volatile uint8_t  * )0x0008738F )
#define ICU_IPR_BIT				( 7U << 0U )


/*
 *  IRQコントロールレジスタ
 */
#define ICU_IRQ0_ADDR			( ( volatile uint8_t  * )0x0008C320 )
#define ICU_IRQ1_ADDR			( ( volatile uint8_t  * )0x0008C321 )
#define ICU_IRQ2_ADDR			( ( volatile uint8_t  * )0x0008C322 )
#define ICU_IRQ3_ADDR			( ( volatile uint8_t  * )0x0008C323 )
#define ICU_IRQ4_ADDR			( ( volatile uint8_t  * )0x0008C324 )
#define ICU_IRQ5_ADDR			( ( volatile uint8_t  * )0x0008C325 )
#define ICU_IRQ6_ADDR			( ( volatile uint8_t  * )0x0008C326 )
#define ICU_IRQ7_ADDR			( ( volatile uint8_t  * )0x0008C327 )
#define ICU_IRQ8_ADDR			( ( volatile uint8_t  * )0x0008C328 )
#define ICU_IRQ9_ADDR			( ( volatile uint8_t  * )0x0008C329 )
#define ICU_IRQ10_ADDR			( ( volatile uint8_t  * )0x0008C32A )
#define ICU_IRQ11_ADDR			( ( volatile uint8_t  * )0x0008C32B )
#define ICU_IRQ12_ADDR			( ( volatile uint8_t  * )0x0008C32C )
#define ICU_IRQ13_ADDR			( ( volatile uint8_t  * )0x0008C32D )
#define ICU_IRQ14_ADDR			( ( volatile uint8_t  * )0x0008C32E )
#define ICU_IRQ15_ADDR			( ( volatile uint8_t  * )0x0008C32F )
#define ICU_IRQMD_BIT			( 3U << 2U )


/*
 *  各チャンネルのレジスタ及び設定ビット情報
 */
#define CMT_CMSTR0_ADDR			( ( volatile uint16_t  * )0x00088000 )
#define CMT_CMSTR0_STR0_BIT		( 1U << 0U )
#define CMT_CMSTR0_STR1_BIT		( 1U << 1U )
#define CMT_CMSTR1_ADDR			( ( volatile uint16_t  * )0x00088010 )
#define CMT_CMSTR1_STR2_BIT		( 1U << 0U )
#define CMT_CMSTR1_STR3_BIT		( 1U << 1U )
#define CMT0_CMCR_ADDR			( ( volatile uint16_t  * )0x00088002 )
#define CMT0_CMCR_CKS_BIT		( 3U )
#define CMT0_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT1_CMCR_ADDR			( ( volatile uint16_t  * )0x00088008 )
#define CMT1_CMCR_CKS_BIT		( 3U )
#define CMT1_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT2_CMCR_ADDR			( ( volatile uint16_t  * )0x00088012 )
#define CMT2_CMCR_CKS_BIT		( 3U)
#define CMT2_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT3_CMCR_ADDR			( ( volatile uint16_t  * )0x00088018 )
#define CMT3_CMCR_CKS_BIT		( 3U )
#define CMT3_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT0_CMCNT_ADDR			( ( volatile uint16_t  * )0x00088004 )
#define CMT1_CMCNT_ADDR			( ( volatile uint16_t  * )0x0008800A )
#define CMT2_CMCNT_ADDR			( ( volatile uint16_t  * )0x00088014 )
#define CMT3_CMCNT_ADDR			( ( volatile uint16_t  * )0x0008801A )
#define CMT0_CMCOR_ADDR			( ( volatile uint16_t  * )0x00088006 )
#define CMT1_CMCOR_ADDR			( ( volatile uint16_t  * )0x0008800C )
#define CMT2_CMCOR_ADDR			( ( volatile uint16_t  * )0x00088016 )
#define CMT3_CMCOR_ADDR			( ( volatile uint16_t  * )0x0008801C )

#define SCI0_SMR_ADDR			( ( volatile uint8_t  * )0x00088240 )
#define SCI0_BRR_ADDR			( ( volatile uint8_t  * )0x00088241 )
#define SCI0_SCR_ADDR			( ( volatile uint8_t  * )0x00088242 )
#define SCI0_TDR_ADDR			( ( volatile uint8_t  * )0x00088243 )
#define SCI0_SSR_ADDR			( ( volatile uint8_t  * )0x00088244 )
#define SCI0_RDR_ADDR			( ( volatile uint8_t  * )0x00088245 )
#define SCI0_SCMR_ADDR			( ( volatile uint8_t  * )0x00088246 )
#define SCI0_SEMR_ADDR			( ( volatile uint8_t  * )0x00088247 )
#define SCI1_SMR_ADDR			( ( volatile uint8_t  * )0x00088248 )
#define SCI1_BRR_ADDR			( ( volatile uint8_t  * )0x00088249 )
#define SCI1_SCR_ADDR			( ( volatile uint8_t  * )0x0008824A )
#define SCI1_TDR_ADDR			( ( volatile uint8_t  * )0x0008824B )
#define SCI1_SSR_ADDR			( ( volatile uint8_t  * )0x0008824C )
#define SCI1_RDR_ADDR			( ( volatile uint8_t  * )0x0008824D )
#define SCI1_SCMR_ADDR			( ( volatile uint8_t  * )0x0008824E )
#define SCI1_SEMR_ADDR			( ( volatile uint8_t  * )0x0008824F )
#define SCI2_SMR_ADDR			( ( volatile uint8_t  * )0x00088250 )
#define SCI2_BRR_ADDR			( ( volatile uint8_t  * )0x00088251 )
#define SCI2_SCR_ADDR			( ( volatile uint8_t  * )0x00088252 )
#define SCI2_TDR_ADDR			( ( volatile uint8_t  * )0x00088253 )
#define SCI2_SSR_ADDR			( ( volatile uint8_t  * )0x00088254 )
#define SCI2_RDR_ADDR			( ( volatile uint8_t  * )0x00088255 )
#define SCI2_SCMR_ADDR			( ( volatile uint8_t  * )0x00088256 )
#define SCI2_SEMR_ADDR			( ( volatile uint8_t  * )0x00088257 )
#define SCI3_SMR_ADDR			( ( volatile uint8_t  * )0x00088258 )
#define SCI3_BRR_ADDR			( ( volatile uint8_t  * )0x00088259 )
#define SCI3_SCR_ADDR			( ( volatile uint8_t  * )0x0008825A )
#define SCI3_TDR_ADDR			( ( volatile uint8_t  * )0x0008825B )
#define SCI3_SSR_ADDR			( ( volatile uint8_t  * )0x0008825C )
#define SCI3_RDR_ADDR			( ( volatile uint8_t  * )0x0008825D )
#define SCI3_SCMR_ADDR			( ( volatile uint8_t  * )0x0008825E )
#define SCI3_SEMR_ADDR			( ( volatile uint8_t  * )0x0008825F )
#define SCI4_SMR_ADDR			( ( volatile uint8_t  * )0x00088260 )
#define SCI4_BRR_ADDR			( ( volatile uint8_t  * )0x00088261 )
#define SCI4_SCR_ADDR			( ( volatile uint8_t  * )0x00088262 )
#define SCI4_TDR_ADDR			( ( volatile uint8_t  * )0x00088263 )
#define SCI4_SSR_ADDR			( ( volatile uint8_t  * )0x00088264 )
#define SCI4_RDR_ADDR			( ( volatile uint8_t  * )0x00088265 )
#define SCI4_SCMR_ADDR			( ( volatile uint8_t  * )0x00088266 )
#define SCI4_SEMR_ADDR			( ( volatile uint8_t  * )0x00088267 )
#define SCI5_SMR_ADDR			( ( volatile uint8_t  * )0x00088268 )
#define SCI5_BRR_ADDR			( ( volatile uint8_t  * )0x00088269 )
#define SCI5_SCR_ADDR			( ( volatile uint8_t  * )0x0008826A )
#define SCI5_TDR_ADDR			( ( volatile uint8_t  * )0x0008826B )
#define SCI5_SSR_ADDR			( ( volatile uint8_t  * )0x0008826C )
#define SCI5_RDR_ADDR			( ( volatile uint8_t  * )0x0008826D )
#define SCI5_SCMR_ADDR			( ( volatile uint8_t  * )0x0008826E )
#define SCI5_SEMR_ADDR			( ( volatile uint8_t  * )0x0008826F )
#define SCI6_SMR_ADDR			( ( volatile uint8_t  * )0x00088270 )
#define SCI6_BRR_ADDR			( ( volatile uint8_t  * )0x00088271 )
#define SCI6_SCR_ADDR			( ( volatile uint8_t  * )0x00088272 )
#define SCI6_TDR_ADDR			( ( volatile uint8_t  * )0x00088273 )
#define SCI6_SSR_ADDR			( ( volatile uint8_t  * )0x00088274 )
#define SCI6_RDR_ADDR			( ( volatile uint8_t  * )0x00088275 )
#define SCI6_SCMR_ADDR			( ( volatile uint8_t  * )0x00088276 )
#define SCI6_SEMR_ADDR			( ( volatile uint8_t  * )0x00088277 )
#define SCI_SMR_CKS_BIT			( 3U << 0U )
#define SCI_SMR_STOP_BIT		( 1U << 3U )
#define SCI_SMR_PM_BIT			( 1U << 4U )
#define SCI_SMR_PE_BIT			( 1U << 5U )
#define SCI_SMR_CHR_BIT			( 1U << 6U )
#define SCI_SMR_CM_BIT			( 1U << 7U )
#define SCI_SCR_CKE_BIT			( 3U << 0U )
#define SCI_SCR_TEIE_BIT		( 1U << 2U )
#define SCI_SCR_RE_BIT			( 1U << 4U )
#define SCI_SCR_TE_BIT			( 1U << 5U )
#define SCI_SCR_RIE_BIT			( 1U << 6U )
#define SCI_SCR_TIE_BIT			( 1U << 7U )
#define SCI_SSR_TEND_BIT		( 1U << 2U )
#define SCI_SSR_PER_BIT			( 1U << 3U )
#define SCI_SSR_FER_BIT			( 1U << 4U )
#define SCI_SSR_ORER_BIT		( 1U << 5U )
#define SCI_SCMR_SMIF_BIT		( 1U << 0U )
#define SCI_SCMR_SINV_BIT		( 1U << 2U )
#define SCI_SCMR_SDIR_BIT		( 1U << 3U )
#define SCI_SCMR_BCP2_BIT		( 1U << 7U )
#define SCI_SEMR_ACS0_BIT		( 1U << 0U )
#define SCI_SEMR_ABCS_BIT		( 1U << 4U )

