farmer-bism/bismath_evalkit_target/asp/arch/rx_gcc/rx610.h
/*
 *  I/Oポートのレジスタ及び設定ビット情報
 */
#define PORT0_DDR_ADDR			( ( volatile uint8_t  * )0x0008C000 )
#define PORT1_DDR_ADDR			( ( volatile uint8_t  * )0x0008C001 )
#define PORT2_DDR_ADDR			( ( volatile uint8_t  * )0x0008C002 )
#define PORT3_DDR_ADDR			( ( volatile uint8_t  * )0x0008C003 )
#define PORT4_DDR_ADDR			( ( volatile uint8_t  * )0x0008C004 )
#define PORT5_DDR_ADDR			( ( volatile uint8_t  * )0x0008C005 )
#define PORT6_DDR_ADDR			( ( volatile uint8_t  * )0x0008C006 )
#define PORT7_DDR_ADDR			( ( volatile uint8_t  * )0x0008C007 )
#define PORT8_DDR_ADDR			( ( volatile uint8_t  * )0x0008C008 )
#define PORT9_DDR_ADDR			( ( volatile uint8_t  * )0x0008C009 )
#define PORTA_DDR_ADDR			( ( volatile uint8_t  * )0x0008C00A )
#define PORTB_DDR_ADDR			( ( volatile uint8_t  * )0x0008C00B )
#define PORTC_DDR_ADDR			( ( volatile uint8_t  * )0x0008C00C )
#define PORTD_DDR_ADDR			( ( volatile uint8_t  * )0x0008C00D )
#define PORTE_DDR_ADDR			( ( volatile uint8_t  * )0x0008C00E )
#define PORTF_DDR_ADDR			( ( volatile uint8_t  * )0x0008C00F )
#define PORTG_DDR_ADDR			( ( volatile uint8_t  * )0x0008C010 )
#define PORTH_DDR_ADDR			( ( volatile uint8_t  * )0x0008C011 )
#define PORT_DDR_B0_BIT			( 0x01U << 0U )
#define PORT_DDR_B1_BIT			( 0x01U << 1U )
#define PORT_DDR_B2_BIT			( 0x01U << 2U )
#define PORT_DDR_B3_BIT			( 0x01U << 3U )
#define PORT_DDR_B4_BIT			( 0x01U << 4U )
#define PORT_DDR_B5_BIT			( 0x01U << 5U )
#define PORT_DDR_B6_BIT			( 0x01U << 6U )
#define PORT_DDR_B7_BIT			( 0x01U << 7U )
#define PORT0_DR_ADDR			( ( volatile uint8_t  * )0x0008C020 )
#define PORT1_DR_ADDR			( ( volatile uint8_t  * )0x0008C021 )
#define PORT2_DR_ADDR			( ( volatile uint8_t  * )0x0008C022 )
#define PORT3_DR_ADDR			( ( volatile uint8_t  * )0x0008C023 )
#define PORT4_DR_ADDR			( ( volatile uint8_t  * )0x0008C024 )
#define PORT5_DR_ADDR			( ( volatile uint8_t  * )0x0008C025 )
#define PORT6_DR_ADDR			( ( volatile uint8_t  * )0x0008C026 )
#define PORT7_DR_ADDR			( ( volatile uint8_t  * )0x0008C027 )
#define PORT8_DR_ADDR			( ( volatile uint8_t  * )0x0008C028 )
#define PORT9_DR_ADDR			( ( volatile uint8_t  * )0x0008C029 )
#define PORTA_DR_ADDR			( ( volatile uint8_t  * )0x0008C02A )
#define PORTB_DR_ADDR			( ( volatile uint8_t  * )0x0008C02B )
#define PORTC_DR_ADDR			( ( volatile uint8_t  * )0x0008C02C )
#define PORTD_DR_ADDR			( ( volatile uint8_t  * )0x0008C02D )
#define PORTE_DR_ADDR			( ( volatile uint8_t  * )0x0008C02E )
#define PORTF_DR_ADDR			( ( volatile uint8_t  * )0x0008C02F )
#define PORTG_DR_ADDR			( ( volatile uint8_t  * )0x0008C030 )
#define PORTH_DR_ADDR			( ( volatile uint8_t  * )0x0008C031 )
#define PORT_DR_B0_BIT			( 0x01U << 0U )
#define PORT_DR_B1_BIT			( 0x01U << 1U )
#define PORT_DR_B2_BIT			( 0x01U << 2U )
#define PORT_DR_B3_BIT			( 0x01U << 3U )
#define PORT_DR_B4_BIT			( 0x01U << 4U )
#define PORT_DR_B5_BIT			( 0x01U << 5U )
#define PORT_DR_B6_BIT			( 0x01U << 6U )
#define PORT_DR_B7_BIT			( 0x01U << 7U )
#define PORT0_ICR_ADDR			( ( volatile uint8_t  * )0x0008C060 )
#define PORT1_ICR_ADDR			( ( volatile uint8_t  * )0x0008C061 )
#define PORT2_ICR_ADDR			( ( volatile uint8_t  * )0x0008C062 )
#define PORT3_ICR_ADDR			( ( volatile uint8_t  * )0x0008C063 )
#define PORT4_ICR_ADDR			( ( volatile uint8_t  * )0x0008C064 )
#define PORT5_ICR_ADDR			( ( volatile uint8_t  * )0x0008C065 )
#define PORT6_ICR_ADDR			( ( volatile uint8_t  * )0x0008C066 )
#define PORT7_ICR_ADDR			( ( volatile uint8_t  * )0x0008C067 )
#define PORT8_ICR_ADDR			( ( volatile uint8_t  * )0x0008C068 )
#define PORT9_ICR_ADDR			( ( volatile uint8_t  * )0x0008C068 )
#define PORTA_ICR_ADDR			( ( volatile uint8_t  * )0x0008C06A )
#define PORTB_ICR_ADDR			( ( volatile uint8_t  * )0x0008C06B )
#define PORTC_ICR_ADDR			( ( volatile uint8_t  * )0x0008C06C )
#define PORTD_ICR_ADDR			( ( volatile uint8_t  * )0x0008C06D )
#define PORTE_ICR_ADDR			( ( volatile uint8_t  * )0x0008C06E )
#define PORTF_ICR_ADDR			( ( volatile uint8_t  * )0x0008C06F )
#define PORTG_ICR_ADDR			( ( volatile uint8_t  * )0x0008C070 )
#define PORTH_ICR_ADDR			( ( volatile uint8_t  * )0x0008C071 )
#define PORT_ICR_B0_BIT			( 0x01U << 0U )
#define PORT_ICR_B1_BIT			( 0x01U << 1U )
#define PORT_ICR_B2_BIT			( 0x01U << 2U )
#define PORT_ICR_B3_BIT			( 0x01U << 3U )
#define PORT_ICR_B4_BIT			( 0x01U << 4U )
#define PORT_ICR_B5_BIT			( 0x01U << 5U )
#define PORT_ICR_B6_BIT			( 0x01U << 6U )
#define PORT_ICR_B7_BIT			( 0x01U << 7U )

/*
 *  UART関連の定義
 *
 *  pdicのrx600/rx610_uart.cで使用する．
 */
/*
 *  シリアルI/Oの個数
 */
#define TNUM_SIOP			( 7 )

#endif	/* TOPPERS_RX610_H */

